export const regex = {
  name: /^([A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[' -][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*){3,30}$/,
  fullName:
    /^([A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[' -][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*)\s+([A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[' -][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*){1,30}$/,
  idNumber: /^[A-Z0-9]{5,20}$/,
  surname: /^([A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[' -][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*){3,30}$/,
  phone: /^\d{7,15}$/,
  email: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/,
  message: /^.{6,200}$/,
  address: /^[a-zA-ZÁÉÍÓÚáéíóúÑñ.,'°\-\/\s]{3,50}\s+\d{1,6}$/,
  postalCode: /^[A-Za-z0-9\s\-]{3,10}$/,
  locality: /^[A-ZÁÉÍÓÚÜÑa-záéíóúüñ'’\- ]{2,50}$/,
  password:
    /^(?=.*[A-Z])(?=.*\d)(?=.*[!@#$%^&*()_+=[\]{};':"\\|,.<>/?~-])[A-Za-z\d!@#$%^&*()_+=[\]{};':"\\|,.<>/?~-]{8,}$/,
};
